# ===============================
# 标签体系（Tag System）
# ===============================

TAG_DEFINITIONS = {

    # ========= 情绪（Mood） =========
    "mood": {
        "💔_失恋": ["失恋", "分手", "heartbreak", "sad", "breakup"],
        "💔_孤独": ["孤独", "loneliness", "alone", "空虚"],
        "😢_悲伤": ["悲伤", "难过", "哭", "sad"],
        "😌_治愈": ["治愈", "温柔", "安静", "relax"],
        "😊_开心": ["开心", "快乐", "happy"],
        "🔥_热血": ["热血", "燃", "battle", "激昂"],
        "😎_酷": ["酷", "swagger", "酷炫"],
    },

    # ========= 场景（Scene） =========
    "scene": {
        "🌙_夜晚": ["夜", "深夜", "night", "midnight"],
        "📖_学习": ["学习", "专注", "study", "focus"],
        "🚗_车载": ["车载", "drive", "road"],
        "🏃_运动": ["运动", "gym", "workout"],
        "🛌_睡眠": ["睡眠", "助眠", "sleep"],
        "🎉_派对": ["派对", "party"],
    },

    # ========= 风格 / 流派（Genre） =========
    "genre": {
        "🎧_流行": ["流行", "pop"],
        "🎧_摇滚": ["摇滚", "rock"],
        "🎧_电子": ["电子", "edm", "dj"],
        "🎧_说唱": ["说唱", "rap", "hiphop"],
        "🎧_民谣": ["民谣", "folk"],
        "🎧_爵士": ["jazz", "爵士"],
        "🎧_国风": ["国风", "古风"],
    },

    # ========= 主题 / 人生阶段（Theme） =========
    "theme": {
        "🎓_毕业": ["毕业", "离别"],
        "💍_爱情": ["爱情", "恋爱"],
        "📼_回忆": ["回忆", "怀旧", "nostalgia", "经典", "memory", "过去"],
        "🌌_理想": ["理想", "梦想", "未来"],
        "🧳_成长": ["成长", "人生"],
        "🌙_夜晚": ["夜晚", "深夜", "night", "midnight", "安静"],
        "📖_学习": ["学习", "专注", "study", "focus"],
        "🌿_轻松": ["轻松", "relax", "chill", "lofi"],
        "🔥_热血": ["热血", "energic", "battle", "激昂"],
        "🌈_青春": ["青春", "校园", "youth","学生"]
    },

    # ========= 编制 / 形式（Form） =========
    "form": {
        "🎼_纯音乐": ["纯音乐", "instrumental"],
        "🎹_钢琴": ["钢琴", "piano"],
        "🎸_吉他": ["吉他", "guitar"],
        "🎤_现场": ["live", "现场"],
    },

    # ========= 属性 / 热度（Meta） =========
    "meta": {
        "📈_热门": ["热门", "热歌", "top", "榜单"],
        "🏆_经典": ["经典", "名曲"],
        # "🎵_翻唱": ["翻唱", "cover"],
        "🧊_小众": ["小众", "冷门"],
    },

    # ========= 歌手精选（Artist） =========
    "artist":{
        "🎤_精选": ["精选", "best", "合集", "collection", "必点"],
    }
}

REMOVE_TEXT = "DJ"

